{"class_name": "Model", "config": {"name": "model_24", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_28"}, "name": "input_28", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "conv1d_219", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [32], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_219", "inbound_nodes": [[["input_28", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_220", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [64], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_220", "inbound_nodes": [[["conv1d_219", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_55", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_55", "inbound_nodes": [[["conv1d_220", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_21", "inbound_nodes": [[["flatten_55", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_7", "op": "Mul", "input": ["activation_21/Identity", "Mul_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 256.0}}, "name": "tf_op_layer_Mul_7", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector_50", "trainable": true, "dtype": "float32", "n": 100}, "name": "repeat_vector_50", "inbound_nodes": [[["tf_op_layer_Mul_7", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_76", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "name": "permute_76", "inbound_nodes": [[["repeat_vector_50", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_26", "trainable": true, "dtype": "float32"}, "name": "multiply_26", "inbound_nodes": [[["conv1d_219", 0, 0, {}], ["permute_76", 0, 0, {}]]]}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector_51", "trainable": true, "dtype": "float32", "n": 1}, "name": "repeat_vector_51", "inbound_nodes": [[["tf_op_layer_Mul_7", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_27", "layers": [{"class_name": "Conv1D", "config": {"name": "conv1d_212", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [20], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_81", "trainable": true, "dtype": "float32", "strides": [5], "pool_size": [5], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_82", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_80", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_213", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [20], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_82", "trainable": true, "dtype": "float32", "strides": [5], "pool_size": [5], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_83", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_81", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_214", "trainable": true, "dtype": "float32", "filters": 50, "kernel_size": [20], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_83", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_84", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_54", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_66", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_27", "trainable": true, "dtype": "float32", "target_shape": [4, 2]}}, {"class_name": "Conv1D", "config": {"name": "conv1d_215", "trainable": true, "batch_input_shape": [null, 256, 4], "dtype": "float32", "filters": 100, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_85", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_82", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_216", "trainable": true, "batch_input_shape": [null, 256, 4], "dtype": "float32", "filters": 256, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Permute", "config": {"name": "permute_75", "trainable": true, "dtype": "float32", "dims": [2, 1]}}, {"class_name": "Conv1D", "config": {"name": "conv1d_217", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [20], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_218", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [10], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_27", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_67", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}}], "build_input_shape": [null, 256, 100]}, "name": "sequential_27", "inbound_nodes": [[["multiply_26", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_77", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "name": "permute_77", "inbound_nodes": [[["repeat_vector_51", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_23", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_23", "inbound_nodes": [[["sequential_27", 0, 0, {}], ["permute_77", 0, 0, {}]]]}], "input_layers": [["input_28", 0, 0]], "output_layers": [["concatenate_23", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}